test/request-response-samples/GetItemInformation__should_ignore_default_namespace_from_schema/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="SAMPLE"><soap:Body><GetItemInformation xmlns="SAMPLE"><Items><Item><ItemNumber>1234</ItemNumber><RequestedQuantity><Value>1.00</Value></RequestedQuantity></Item></Items></GetItemInformation></soap:Body></soap:Envelope>