test/request-response-samples/GetItemInformation__should_order_elements_in_sequence_correctly/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="SAMPLE"><soap:Body><GetItemInformation xmlns="SAMPLE"><Items><Item><ItemNumber>1234</ItemNumber><SupplierName>Joe Supplier</SupplierName><RequestedQuantity><Description>The description</Description><AvailState><AvailState>1</AvailState></AvailState><Value>1.00</Value></RequestedQuantity></Item></Items></GetItemInformation></soap:Body></soap:Envelope>
